/*
**
*****************************************************************************
**
** Project     : OpenCV sample project
** Module      : video_sdl.c
** Description : OpenCV と SDL の連携
**               OpenCV で取得したフレームをSDLのスクリーン中央に貼り付け 
**
** Version : Date:          Author:       Comment:
**     1.0   2011/09/16(金) Akinori Tsuji Creation
*****************************************************************************
**
*/
#ifndef _IPL2SURFACE_H_

/*________ INCLUDES _______________________________________________________*/

/*________ MACROS _________________________________________________________*/

/*________ DEFINITIONS ____________________________________________________*/

/*________ VARIABLES ______________________________________________________*/

/*________ LOCAL-FUNCTION PROTOTYPES ______________________________________*/
SDL_Surface *ipl_to_surface(IplImage *img); // 画像をIPLからSDLへ変換

/*________ LOCAL-FUNCTIONS ________________________________________________*/

#endif // _IPL2SURFACE_H_

